pub fn info() {
    println!(
        "
╔══════════════════════════════════════════════════════════════════════════╗
║                        Rust Project Starter Kit                          ║
╚══════════════════════════════════════════════════════════════════════════╝

 🦀 Current Features:
 ┌────────────────────────────────────────────────────────────────────────┐
 │ ✅ MongoDB Support                                                     │
 │ ✅ Add HTTP REST APIs (Axum Framework)                                 │
 │ ✅ Develop Modular and Extensible Codebase                             │
 │ ✅ Implement CRUD Operations                                           │
 │ ✅ Add PostgreSQL Support (Still to implement repo functions)          │
 │ ✅  Add Docker Support                                                 │
 └────────────────────────────────────────────────────────────────────────┘

 📋 TODO:
 ┌────────────────────────────────────────────────────────────────────────┐
 │ ⬜ Implement Basic Input Validation                                    │
 │ ⬜ Add SurrealDB Support                                               │
 │ ⬜ Add SQL Database Support                                            │
 │ ⬜ Implement Authentication System                                     │
 │ ⬜ Implement Event Tracking                                            │
 └────────────────────────────────────────────────────────────────────────┘

 🚀 Get started by running 'cargo run' or check the README for more info!
    "
    );
}
